Revit 2027 API
ExtendedPropertiesBindings Properties
The ExtendedPropertiesBindings type exposes the following members.
Properties
Name | Description
BindingType |  Indicates type vs instance bindings. Defaults to Instance.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
ExtendedPropertiesBindings Class
Autodesk.Revit.DB.ExternalData Namespace